#对级别为1的员工升一级、加薪1000
info={
    "王力宏":
    {
        "部门":"科技部",
        "工资":7000,
        "级别":1
    },
    "周杰伦":
    {
        "部门":"市场部",
        "工资":5000,
        "级别":2
    },
    "林俊杰":
    {
        "部门":"市场部",
        "工资":7000,
        "级别":3
    },
    "张学友":
    {
        "部门":"科技部",
        "工资":4000,
        "级别":1
    },
    "刘德华":
    {
        "部门":"市场部",
        "工资":6000,
        "级别":2
    }
}
print(info)
print("对所有级别为1的员工,级别升1级,薪水增加1000元")
# for key in info:
#     if info[key]["级别"]==1:
#         info[key]["级别"]+=1
#         info[key]["工资"]+=1000
# print(f"经过升级后的数据：{info}")