#序列就是 内容连续、有序、有下标索引的一类数据容器
#比如 列表 元组 字符串
#切片就是对序列的截取
#lst1[起始：结束：步长]，就能截取list1中的某一部分出来，注意这里不是改变原来的数据，而是截取后生成新的变量
#lst1[起始：结束：步长]   起始、结束、步长如果不填，则默认开头、结尾、步长为1


#对列表的切片
list1=[0,1,2,3,4,5,6,7,8,9]
print(list1[:])
print(f"列表从头到尾步长为2:{list1[::2]}")
#对元组的切片
t1=(0,1,2,3,4,5,6,7,8,9)
print(t1[2::-1])   #假如步长为负时，就会从起始位置进行反向遍历
print(t1[:7:-1])
#对字符串的遍历
str1="iloveheimacxy"
print(str1[::-2])
print(str1[::])
print("-------------------------")
#小练习  得到  黑马程序员
str2="万过月薪,员序程马黑来,nohtyp学"
index_start=str2.index("黑")
index_end=str2.index("员")
print(str2[index_start:index_end-1:-1])
#用split分隔得到 ， 员序程马黑来  ，再替换掉 来  再逆序
print(str2.split(",")[1].replace("来","")[::-1])